print("Парадокс Монти Хола.")
c1 = 0
c2 = 0
n1 = 0
n2 = 0
import random
for i in range(0,10000):
    a = [0, 0, 1]
    b1 = random.choice(a)
    a.remove(0)
    b2 = random.choice(a)
    if b1 == b2:
        if b1 == 1:
            c1 = c1 + 1
        else:
            c2 = c2 + 1
    else:
        if b2 == 1:
            n1 = n1 + 1
        else:
            n2 = n2 + 1
s1 = c1//((c1+c2)//100)
s2 = n1//((n1+n2)//100)

print(f"Количество побед при фиксации выбора: {c1}\nКоличество поражений при фиксации выбора: {c2}\nКоличество побед при изменении выбора: {n1}\nКоличество поражений при изменении выбора: {n2}")
print(f"\nПримерный процент профицита от изменения выбора: {s2-s1}")